[
  {
    "id": "elizabeth-montgomeryjames",
    "author": "Elizabeth MontgomeryJames",
    "rating": 5,
    "text": "Jonathan and his team were 100% professional. When I contacted him we had a quote the same day, and an appointment for the work scheduled within 1 week. The team arrived on time, did precise work and cleaned up so well you would have never known they were there.",
    "relativeTime": "3 months ago"
  },
  {
    "id": "kristine-richichi",
    "author": "Kristine Richichi",
    "rating": 5,
    "text": "The most excellent tree service you'll find. Jonathan Stirman knows trees! He's been trimming my huge oak tree for years. He and his team are always professional, knowledgeable, pricing reasonable, and they do an amazing job with clean up. Outstanding service!",
    "relativeTime": "3 years ago"
  },
  {
    "id": "clint-cunningham",
    "author": "Clint Cunningham",
    "rating": 5,
    "text": "Jonathan and team did a great job removing a 70' sweet gum tree and the oak limb that had been rubbing against it. The tree and limb were close behind my house but Jonathan's team carefully maneuvered their equipment to the back of my property and completed the work safely.",
    "relativeTime": "5 months ago"
  },
  {
    "id": "ab-bernard",
    "author": "AB Bernard",
    "rating": 5,
    "text": "This is one of the best tree services I have ever worked with. All of the employees are super professional and are in safety gear at all times. They removed three large live oaks that were over our house, which you can imagine is terrifying as the homeowner. These guys came with the right equipment to do the job in a safe manner. They also trimmed our other trees in a way that supports healthy growth over time. To top it off they left our property looking better than when they arrived. They blew off all the leaves and did a few other chores that helped us out a lot. I would not use any other tree service again! Positive: Responsiveness, Punctuality, Quality, Professionalism, Value. Services: Tree removal, tree stump grinding, tree trimming & pruning.",
    "relativeTime": "3 years ago"
  },
  {
    "id": "dan-jeancola",
    "author": "Dan Jeancola",
    "rating": 5,
    "text": "Stop looking for a tree service and hire Jonathan Stirman Tree Service! Priced right, on time, completed ahead of schedule, professional, respectful, and cleaned up the project at the end. In our case this was a tree that 75% of the 20+ companies that came out to quote walked away from as it was over their heads. It was a monster hazardous tree. Jon's crew took it on and got it done. They brought out the right people and the right equipment. Rarely in this day and age do companies do what they say and say what they do. These guys are the real deal, and I am not easy to please or a guy that writes reviews. Thanks to Jon and his team!",
    "relativeTime": "8 years ago"
  }
]
